{
    "distro": {
        "title": "Arch Linux",
        "forslug": "arch",
        "desc": "# Arch Linux<p>Arch Linux is a rolling-release Linux distribution known for its simplicity, flexibility, and user-centric approach. It follows a minimalist philosophy, providing users with the freedom to build their own customized system. Arch Linux uses the Pacman package manager and the Arch Build System (ABS) for package management and building.</p><h2>Features and Philosophy</h2><ul><li><strong>Rolling Release Model:</strong> Arch Linux follows a rolling release model, meaning that users receive the latest software updates continuously. This allows for a more up-to-date system without the need for periodic major upgrades.</li><li><strong>Customization and DIY Approach:</strong> Arch Linux is designed for users who prefer to have full control over their system. The Arch Wiki is a valuable resource for users to understand and customize every aspect of their Arch Linux installation.</li><li><strong>Pacman Package Manager:</strong> Pacman is the package manager used in Arch Linux. It simplifies package management tasks, including installation, removal, and system upgrades.</li></ul><h2>Basic Commands</h2><p>Here are some essential commands for Arch Linux:</p><ul><li><code>pacman -Syu</code>: Update the system and installed packages.</li><li><code>pacman -S [package]</code>: Install a new package.</li><li><code>pacman -R [package]</code>: Remove a package.</li><li><code>yay -S [package]</code>: Install packages from the Arch User Repository (AUR).</li></ul><h2>Sub-Distributions</h2><p>Arch Linux has inspired several popular distributions, each catering to specific user needs. Let's explore a couple of them:</p>",
        "img": "https://w7.pngwing.com/pngs/809/243/png-transparent-arch-linux-tgz-linux-angle-triangle-logo-thumbnail.png",
        "oneLiner": "Arch Linux is a lightweight and highly customizable Linux distribution with a <strong>do-it-yourself</strong> philosophy, providing users with a minimal base to build their personalized systems." 
    },
        "subDistrs": [
            {
                "title": "Manjaro",
                "forslug": "manjaro",
                "img": "https://wiki.manjaro.org/images/1/18/Block-logo.png",
                "oneLiner": "Manjaro Linux is a user-friendly and rolling-release distribution that leverages Arch Linux's benefits with a simplified approach and pre-configured desktop environments."
            },
            {
                "title": "EndeavourOS",
                "forslug": "endeavouros",
                "img": "https://raw.githubusercontent.com/endeavouros-team/endeavouros-theming/master/endeavouros-icon.png",
                "oneLiner": "EndeavourOS is an Arch Linux-based distribution that aims to simplify the installation and configuration of Arch while preserving its flexibility, offering a user-friendly experience with a choice of desktop environments."
            }
        ]
    }
