{
    "distro": {
        "title": "Arch Linux",
        "forslug": "arch-linux",
        "desc": "# Arch Linux\nArch Linux is a rolling-release Linux distribution known for its simplicity, flexibility, and user-centric approach. It follows a minimalist philosophy, providing users with the freedom to build their own customized system. Arch Linux uses the Pacman package manager and the Arch Build System (ABS) for package management and building.\n\n## Features and Philosophy\n- **Rolling Release Model:** Arch Linux follows a rolling release model, meaning that users receive the latest software updates continuously. This allows for a more up-to-date system without the need for periodic major upgrades.\n\n- **Customization and DIY Approach:** Arch Linux is designed for users who prefer to have full control over their system. The Arch Wiki is a valuable resource for users to understand and customize every aspect of their Arch Linux installation.\n\n- **Pacman Package Manager:** Pacman is the package manager used in Arch Linux. It simplifies package management tasks, including installation, removal, and system upgrades.\n\n## Basic Commands\nHere are some essential commands for Arch Linux:\n\n- `pacman -Syu`: Update the system and installed packages.\n\n- `pacman -S [package]`: Install a new package.\n\n- `pacman -R [package]`: Remove a package.\n\n- `yay -S [package]`: Install packages from the Arch User Repository (AUR).\n\n## Sub-Distributions\nArch Linux has inspired several popular distributions, each catering to specific user needs. Let's explore a couple of them:\n",
        "pros": "Rolling release model,\nHighly customizable,\nPacman package manager.",
        "cons": "Steep learning curve,\nRequires manual configuration.",
        "communityrating": "4.8",
        "Usability": "4.5",
        "Performance": "4.7",
        "subDistrs": [
            {
                "title": "Manjaro",
                "forslug": "manjaro",
                "desc": "# Manjaro\nManjaro is an Arch Linux-based distribution that aims to provide a user-friendly experience without sacrificing the power and flexibility of Arch Linux. It comes with a variety of desktop environments, including Xfce, KDE, and GNOME, allowing users to choose their preferred desktop environment during installation.\n\n## Features\n- **User-Friendly Installation:** Manjaro features a user-friendly installer that simplifies the installation process for users, especially those new to Arch Linux.\n\n- **Access to Arch Linux Repositories:** Manjaro users have access to the Arch User Repository (AUR) and official Arch Linux repositories, allowing them to install a wide range of software.\n\n- **Rolling Release Model:** Similar to Arch Linux, Manjaro follows a rolling release model, providing users with the latest software updates.\n\n## Pros\n- **Ease of Use:** Manjaro is designed to be accessible to users of all experience levels, making it a suitable choice for those new to Arch Linux.\n\n- **Access to AUR:** Users can easily install software from the Arch User Repository, expanding the available software library.\n\n## Cons\n- **Delayed Updates:** While updates are tested for stability, there may be a slight delay compared to Arch Linux's updates.\n\n- **Less Control Compared to Arch:** Manjaro abstracts some of the complexities of Arch Linux, which may limit advanced customization options for expert users.",
                "pros": "User-friendly installation,\nAccess to Arch Linux repositories,\nRolling release model.",
                "cons": "Delayed updates,\nLess control compared to Arch.",
                "ratings": "Community: 4.7\nUsability: 4.6\nPerformance: 4.5"
            },
            {
                "title": "EndeavourOS",
                "forslug": "endeavouros",
                "desc": "# EndeavourOS\nEndeavourOS is an Arch Linux-based distribution that aims to provide a straightforward and user-friendly experience for installing and using Arch Linux. It offers a minimalistic installation that allows users to build their Arch Linux system with their preferred desktop environment and software.\n\n## Features\n- **Graphical Installer:** EndeavourOS includes a graphical installer that simplifies the Arch Linux installation process for users who may find the traditional Arch installation daunting.\n\n- **Rolling Release Model:** Similar to Arch Linux, EndeavourOS follows a rolling release model, ensuring users receive timely updates.\n\n- **Choice of Desktop Environments:** Users can choose from various desktop environments during installation, allowing for customization.\n\n## Pros\n- **Graphical Installer:** EndeavourOS's graphical installer makes it more accessible to users new to Arch Linux.\n\n- **Minimalistic Installation:** Users have the flexibility to build a minimal and customized Arch Linux system based on their preferences.\n\n## Cons\n- **Limited Handholding:** While the graphical installer helps, users are still expected to have a basic understanding of Arch Linux concepts.\n\n- **Smaller Community Compared to Arch and Manjaro:** EndeavourOS has a smaller user community compared to larger distributions.",
                "pros": "Graphical installer,\nRolling release model,\nChoice of desktop environments.",
                "cons": "Limited handholding,\nSmaller community compared to Arch and Manjaro.",
                "ratings": "Community: 4.5\nUsability: 4.3\nPerformance: 4.6"
            }
        ]
    }
}