{
    "distro": {
        "title": "CentOS",
        "forslug": "centos",
        "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/CentOS_color_logo.svg/1200px-CentOS_color_logo.svg.png",
        "desc": "# CentOS\n<p>CentOS is a popular Linux distribution known for its stability, reliability, and long-term support. It is based on the sources of Red Hat Enterprise Linux (RHEL) and aims to provide a free and open-source alternative with binary compatibility. CentOS is suitable for servers, data centers, and enterprise environments where a robust and secure operating system is essential.</p><h2>Features and Philosophy</h2><ul><li><strong>Stability and Reliability:</strong> CentOS is renowned for its stability and reliability, making it a preferred choice for server deployments and critical applications.</li><li><strong>Binary Compatibility with RHEL:</strong> CentOS maintains binary compatibility with RHEL, allowing users to leverage RHEL-compatible software and packages.</li><li><strong>Long-Term Support (LTS):</strong> CentOS follows a long-term support model, providing updates and security patches for an extended period.</li></ul><h2>Basic Commands</h2><p>CentOS uses the YUM (Yellowdog Updater, Modified) package management system. Here are some essential commands:</p><ul><li><code>sudo yum update</code>: Update the system and installed packages.</li><li><code>sudo yum install [package]</code>: Install a new package.</li><li><code>sudo yum remove [package]</code>: Remove a package.</li><li><code>sudo yum search [keyword]</code>: Search for packages matching a keyword.</li><h2>Pros and Cons</h2><p><strong>Pros:</strong></p><ol><li>Stability and reliability.</li><li>Binary compatibility with RHEL.</li><li>Long-term support (LTS).</li></ol><p><strong>Cons:</strong></p><ol><li>May have slightly older software versions.</li><li>Updates may not be as frequent as some other distributions.</li></ol><h2>CentOS Alternatives</h2><p>As of the recent changes in the CentOS project, two alternatives have emerged:</p>",
        "oneLiner": "CentOS is a free, enterprise-class Linux distribution derived from the sources of Red Hat Enterprise Linux (RHEL), known for its stability, long-term support, and focus on server environments."
    },
        "subDistrs": [
            {
                "title": "Rocky Linux",
                "forslug": "rockylinux",
                "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Rocky_Linux_logo.svg/4096px-Rocky_Linux_logo.svg.png",
                "oneLiner": "Rocky Linux is a community-driven, enterprise-grade Linux distribution designed as a downstream, binary-compatible alternative to Red Hat Enterprise Linux (RHEL) after the discontinuation of CentOS's traditional releases. It aims to provide a stable and open-source operating system for enterprise environments."
            },
            {
                "title": "AlmaLinux",
                "forslug": "almalinux",
                "oneLiner": "AlmaLinux is a CentOS alternative, offering a free and stable Linux distribution based on the upstream source code of Red Hat Enterprise Linux (RHEL).",
                "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/AlmaLinux_Icon_Logo.svg/640px-AlmaLinux_Icon_Logo.svg.png"
            }
        ]
    }
